### fisher score

fisher score is one of the most widely used supervised feature selection methods.however,it selects each feature independently according to their scores under the fisher criterion,which lead to a suboptimal subset of features

## chi square(X2)test

this test is any statistical hypothesis test where the sampling distrubution of the test statistic is a chi-squared distrubution

chi square test measures dependence between stochastic variables,so using this function'weeds out' the features that are the most likely to be independent of class and therefore irrelevant of classification for classification

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

from sklearn.feature_selection import chi2
from sklearn.feature_selection import SelectKBest,SelectPercentile
from sklearn.metrics import accuracy_score

In [2]:
titanic=pd.read_csv('C:\\Users\\Admin\\Desktop\\DataScience\\Datasets\\titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
titanic.drop(labels=['Age','Cabin'],axis=1,inplace=True)

In [5]:
titanic=titanic.dropna()

In [6]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [7]:
d=titanic[['Pclass','Sex','SibSp','Parch','Embarked']].copy()

In [8]:
d.head()

   Pclass     Sex  SibSp  Parch Embarked
0       3    male      1      0        S
1       1  female      1      0        C
2       3  female      0      0        S
3       1  female      1      0        S
4       3    male      0      0        S

In [9]:
sex={'male':0,'female':1}
d['Sex']=d['Sex'].map(sex)

In [10]:
d['who']=d['Sex'].map({0:'man',1:'woman'})
d.head()

   Pclass  Sex  SibSp  Parch Embarked    who
0       3    0      1      0        S    man
1       1    1      1      0        C  woman
2       3    1      0      0        S  woman
3       1    1      1      0        S  woman
4       3    0      0      0        S    man

In [11]:
from sklearn.preprocessing import OneHotEncoder
m=OneHotEncoder()
x=d.copy()
y=titanic['Survived']
x=m.fit_transform(x)

In [12]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [13]:
f_score=chi2(X_train,y_train)

In [14]:
f_score

(array([ 39.41163573,   6.47924925,  31.86989068,  82.41541237,
        152.91534343,   3.9031121 ,  16.4535423 ,   1.5856362 ,
          0.24325084,   2.872421  ,   2.40540541,   3.00675676,
          4.49008822,  13.4729458 ,   3.96409049,   2.39191087,
          1.80405405,   0.65690859,   0.60135135,  16.59924709,
          1.17101353,   6.19364956,  82.41541237, 152.91534343]),
 array([3.43245526e-10, 1.09141073e-02, 1.64852837e-08, 1.10290444e-19,
        3.99737147e-35, 4.81967500e-02, 4.98569355e-05, 2.07950709e-01,
        6.21867987e-01, 9.01092270e-02, 1.20916796e-01, 8.29180445e-02,
        3.40919184e-02, 2.42028021e-04, 4.64806251e-02, 1.21964464e-01,
        1.79223151e-01, 4.17653452e-01, 4.38062888e-01, 4.61693464e-05,
        2.79193086e-01, 1.28209518e-02, 1.10290444e-19, 3.99737147e-35]))

In [15]:
clf=RandomForestClassifier(n_estimators=100,random_state=0,n_jobs=-1)

In [16]:
clf.fit(X_train,y_train)

RandomForestClassifier(n_jobs=-1, random_state=0)

In [17]:
y_pred=clf.predict(X_test)

In [18]:
accuracy_score(y_test,y_pred)*100

74.15730337078652

In [19]:
x=d[['who','Sex']]
y=titanic['Survived']
x=m.fit_transform(x)

In [20]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [21]:
clf.fit(X_train,y_train)

RandomForestClassifier(n_jobs=-1, random_state=0)

In [22]:
y_pred=clf.predict(X_test)

In [23]:
accuracy_score(y_test,y_pred)*100

71.91011235955057

In [24]:
x=d[['who','Sex','Pclass','Embarked']]
y=titanic['Survived']
x=m.fit_transform(x)

In [25]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [26]:
clf.fit(X_train,y_train)

RandomForestClassifier(n_jobs=-1, random_state=0)

In [27]:
y_pred=clf.predict(X_test)

In [30]:
accuracy_score(y_test,y_pred)*100

74.15730337078652